karaf/secure-proxy/1K_buyStocks_secure.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1"><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="id-1430680512529150000-788803814"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier">Xeg55vRyK3ZhAEhEf+YT0z986L0=</wsse:KeyIdentifier></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>XOSCeMBsnFSAtuITc8rP2EQqmGjHIis0YzEJdqpRnhm3rRwSJ123As3rTTMZvK0aKiDoS2qCPk8i
M1zau9P15lkn1aF/oWcmZtkVuGd8sg2kmI7qwjgXme+HLwSdFRG+GXd/wphdiHw0QkyDDVrCjaGt
ZAzW3TPQokv5AwWW2pk=</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#id-1430680512529296000-405147272"/></xenc:ReferenceList></xenc:EncryptedKey><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-1430680512528818000-870561037">MIIDDDCCAfSgAwIBAgIQM6YEf7FVYx/tZyEXgVComTANBgkqhkiG9w0BAQUFADAwMQ4wDAYDVQQK
DAVPQVNJUzEeMBwGA1UEAwwVT0FTSVMgSW50ZXJvcCBUZXN0IENBMB4XDTA1MDMxOTAwMDAwMFoX
DTE4MDMxOTIzNTk1OVowQjEOMAwGA1UECgwFT0FTSVMxIDAeBgNVBAsMF09BU0lTIEludGVyb3Ag
VGVzdCBDZXJ0MQ4wDAYDVQQDDAVBbGljZTCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAoqi9
9By1VYo0aHrkKCNT4DkIgPL/SgahbeKdGhrbu3K2XG7arfD9tqIBIKMfrX4Gp90NJa85AV1yiNsE
yvq+mUnMpNcKnLXLOjkTmMCqDYbbkehJlXPnaWLzve+mW0pJdPxtf3rbD4PS/cBQIvtpjmrDAU8V
sZKT8DN5Kyz+EZsCAwEAAaOBkzCBkDAJBgNVHRMEAjAAMDMGA1UdHwQsMCowKKImhiRodHRwOi8v
aW50ZXJvcC5iYnRlc3QubmV0L2NybC9jYS5jcmwwDgYDVR0PAQH/BAQDAgSwMB0GA1UdDgQWBBQK
4l0TUHZ1QV3V2QtlLNDm+PoxiDAfBgNVHSMEGDAWgBTAnSj8wes1oR3WqqqgHBpNwkkPDzANBgkq
hkiG9w0BAQUFAAOCAQEABTqpOpvW+6yrLXyUlP2xJbEkohXHI5OWwKWleOb9hlkhWntUalfcFOJA
gUyH30TTpHldzx1+vK2LPzhoUFKYHE1IyQvokBN2JjFO64BQukCKnZhldLRPxGhfkTdxQgdf5rCK
/wh3xVsZCNTfuMNmlAM6lOAg8QduDah3WFZpEA0s2nwQaCNQTNMjJC8tav1CBr6+E5FAmwPXP7pJ
xn9Fw9OXRyqbRA4v2y7YpbGkG2GI9UvOHw6SGvf4FRSthMMO35YbpikGsLix3vAsXWWi4rwfVOYz
QK0OFPNi9RMCUdSH06m9uLWckiCxjos0FQODZE9l4ATGy9s9hNVwryOJTw==</wsse:BinarySecurityToken><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="#id-1430680512525455000-167335529">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>nxVk/OxFOqcwv01LhmitJfvcnto=</ds:DigestValue>
</ds:Reference>
<ds:Reference URI="#id-1430680512525005000-1338545363">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>0gt5+rgBzcndCY+E6l/hHSQB0CI=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
BqY7jQmPhcYx2MjFJgQnwsp6w5dU6aAbyYszBdBwh1xZYh8UmhxiLZMQTyldz25Y8GD4xS8TX4Eq
zwZaECp+Mwxek+lN8StXeuBZpDpzV4jiBym2qFCNm4LWhhN9g46MzoCieshHEs4n5oQUT/R0PuRA
fwLaCsp8na8gGofwTqY=
</ds:SignatureValue>
<ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#id-1430680512528818000-870561037" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-1430680512525005000-1338545363"><wsu:Created>2015-05-03T19:15:12.525Z</wsu:Created><wsu:Expires>2015-06-02T19:15:12.525Z</wsu:Expires></wsu:Timestamp></wsse:Security><routing xmlns="http://someuri">xadmin;server1;community#1.0##</routing></soapenv:Header>
<soapenv:Body wsu:Id="id-1430680512525455000-167335529" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="id-1430680512529296000-405147272" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:Reference URI="#id-1430680512529150000-788803814"/></wsse:SecurityTokenReference>
</ds:KeyInfo><xenc:CipherData><xenc:CipherValue>R0js6RvixFh8J6wPkY3+NNVfw+IpXcVUqQhIL2IMsId6dqbfqzVhFT6YzJw/HpVGg67PrM3fIOsp
969qnn7j5qGbIREfoMkPPvFUV3J4OtroFEQuGHCErwJLwpAbP0kVvALgnT1BJWI5EYrZTTD2G/LZ
a01pG6m4fo2vX+nYGuZYio+QwNK/pZWW9CmcpnGokoebQzRxKUSvOeddzUL++HwrCaudYPJWx0gF
q7EIooSqGngttfNIGy17eFgVvVBj8jOnd1FyetsqChhauIBl/FVXe4SG0qQStNpSc6/zUyoJSovj
XKslPjtlfhAefo0I8hh3aJTNz8st3xn/Z0dWeGtL/BKJ0nXxvyNnmBTeX4pBCYJAQkhdJtJHe2o3
UAxlIbm+3ODbyWWY1lJ8MF91hItlaf72zoCpjlnlFyvBFtsJuEKbskABi3tu5Ntoc6NNjU95YTC/
4vR/5D4c9eyUuHsraNE3jGyqroMz0bVuocO5OMt6fFMwxVXNY8GdJUGj5Fm0cTQQrMbkk2dRHR1q
zGam5Nj72QBkcYNLuE2Y4I5WE3yHjOaa9W+NgezTdUWdsAwBZwV4yesikRmdOqTtMdX++6RFfsb7
ob6aDLRNF55nu2LtDylDJcUL90aA6tvpjBgbDcNJu2sE+R7iR3Ied1Chsc/HLtjoHYq60gohgPRK
31UKwgogvghIPSjtjL9pdkooK0UkD7K7j6pGcCcYYjHRw+C9Uc/EdEs0H0TmYpxdEIDvvj43WvKz
mfBs2fekRK7mkYE/ilU+Yq822f5Y2NBM//0jPRUDZNnuZcN5C74Y+SF/xWZtW6NfwZ5V5i5rmPkw
zY/zGnBViddx/NHEEyWuBqHPvWxakDM4P46nDbgTEX83KRaYA3epo5B129NIyXngO8ZgW9Z0JlMz
bWQQinoO3U5Z9XZKVe81oI3xw6Ze1MNmPTcOyHlGOoozQJctULXwOHaVLWPL+Oifxp3EOnNvagFx
jLWixdjfRWXTnmSqnFgViyPcTjexSGqAtWwk3sdgtwyCmjPwQ2xL9n3/mDe9hUOdlnwGe6GRMbs1
xTKaTyAYWgQ5UfegEHcowH9N</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soapenv:Body>
</soapenv:Envelope>